 [
	   {
		"theme": "Animals",
		"title": "Ceaco - Selfies - Dog Delight - 550 Piece Jigsaw Puzzle",
		"previewImg": "https://m.media-amazon.com/images/I/51mpwtm-uCL._AC_UL320_.jpg",
		"price": "$9.97",
		"numberOfPieces": 550,
		"description": "Hilarious colorful imagery: let it captivate you with vibrant art printed on quality, durable puzzle pieces.\nA customer favorite: adorable depictions of large group of animals taking a silly selfie.\nMakes a great gift: perfect for your child, present for a birthday, Christmas, team building and other events!\nMore to puzzle building: art jigsaw puzzles are a fun, inexpensive way to enjoy beautiful works of art first hand! Use to boost skills: hand-eye coordination, motor skills, problem solving, and much more!\nSpecifics: includes 550 puzzle pieces. When completed, puzzle Dimensions: 24 x 18 inches. It is proudly made in USA.",
		"image": "https://m.media-amazon.com/images/I/51mpwtm-uCL._AC_.jpg"
	   },
	   {
		"theme": "Animals",
		"title": "Buffalo Games - Painting Puppies - 750 Piece Jigsaw Puzzle",
		"previewImg": "https://m.media-amazon.com/images/I/81E5IhfST6L._AC_UL320_.jpg",
		"price": "$12.00",
		"numberOfPieces": 750,
		"age": "14 years and up",
		"description": "Contains a 750 piece jigsaw puzzle\nFinished size is 24 x 18 inches\nFull Color Bonus poster included for help in solving\nManufactured from premium quality materials including 100% recycled paperboard\nBuffalo Games puzzles are manufactured using trademarked \"Perfect Snap\" technology ensuring a tight interlocking fit between pieces",
		"image": "https://m.media-amazon.com/images/I/81E5IhfST6L._AC_SX679_.jpg"
	   },
	   {
		"theme": "Animals",
		"title": "Cobble Hill 1000 Piece Puzzle - Ducks of North America - Sample Poster Included",
		"previewImg": "https://m.media-amazon.com/images/I/61-Ox5VD-GL._AC_UL320_.jpg",
		"price": "$18.93",
		"numberOfPieces": 1000,
		"description": "MADE IN THE US: Cobble Hill Puzzles are proudly manufactured in North America.\nRANDOM-CUT PIECES: This piece design means each puzzle piece looks different - A fun challenge.\nHIGH-QUALITY: The glare-reducing linen paper and crisp image make it a perfect piece to frame.\nEARTH FRIENDLY: All cardboard is made from 100% recycled material. Our ink is also vegetable based.\nNO INSTRUCTIONS REQUIRED: Simply use the box cover or convenient linen print poster included. Finished size is 26.625\" x 19.25”",
		"image": "https://m.media-amazon.com/images/I/61-Ox5VD-GL._AC_.jpg"
	   },
	   {
		"theme": "Animals",
		"title": "Buffalo Games - Picnic Raiders - 300 LARGE Piece Jigsaw Puzzle , Red",
		"previewImg": "https://m.media-amazon.com/images/I/91xU3vJLVlL._AC_UL320_.jpg",
		"price": "$10.95",
		"numberOfPieces": 300,
		"description": "Contains a 300 LARGE piece jigsaw puzzle - these pieces are 33% larger than standard puzzle pieces for improved dexterity and placement\nFinished size is 21.25 x 15 inches\nFull Color Bonus poster included for help in solving\nManufactured from premium quality materials including 100% recycled paperboard\nBuffalo Games puzzles are manufactured using trademarked \"Perfect Snap\" technology ensuring a tight interlocking fit between pieces",
		"image": "https://m.media-amazon.com/images/I/91xU3vJLVlL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Animals",
		"title": "Buffalo Games - Charles Wysocki - Jolly Hill Farms - 500 Piece Jigsaw Puzzle",
		"previewImg": "https://m.media-amazon.com/images/I/81nkdk+fGcL._AC_UL320_.jpg",
		"price": "$9.93",
		"numberOfPieces": 500,
		"age": "14 years and up",
		"description": "Contains a 500 piece jigsaw puzzle\nFinished size is 21.25 in. X 15 in\nFull Color Bonus poster included for help in solving\nManufactured from premium quality materials including 100% recycled paperboard\nBuffalo Games puzzles are manufactured using trademarked \"Perfect Snap\" technology ensuring a tight interlocking fit between pieces",
		"image": "https://m.media-amazon.com/images/I/81nkdk+fGcL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Beach",
		"title": "Vermont Christmas Company Beach Day Jigsaw Puzzle 1000 Piece",
		"previewImg": "https://m.media-amazon.com/images/I/81PEctA86sL._AC_UL320_.jpg",
		"price": "$17.95",
		"numberOfPieces": 1000,
		"age": "14 years and up",
		"description": "Jigsaw puzzle includes 1000 pieces & measures 26 5/8\" x 19 1/4\" when completed.\nFully interlocking and randomly shaped pieces.\nProduced on thick, premium quality puzzle board.\nPrecision cutting with minimal dust. Made with recycled materials.\nYou can almost smell the ocean when completing this fun beach puzzle.",
		"image": "https://m.media-amazon.com/images/I/81PEctA86sL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Beach",
		"title": "4 Pack Large Pieces Jigsaw Puzzles Dementia Alzheimer's Products,Neoflavie 4 Style Puzzle Activities for Elderly Seniors - Easy Puzzle for Adults, Ultra-High-Definition（2 ×16 & 2 ×35 Large Puzzles）",
		"previewImg": "https://m.media-amazon.com/images/I/81zMeM5H6pL._AC_UL320_.jpg",
		"price": "$17.99",
		"numberOfPieces": 4,
		"age": "12 years and up",
		"description": "🧩Puzzles of Blue Card Materials - Neoflavie's each piece of large puzzles use hard cardstock, each piece of large puzzles are thicker to 0.1 inches, can be used repeatedly. 1:1 Oiginal Image-it can help you when you are overwhelmed what to do next. the surface is printed with Matte film to improve the friction easier to grasp、water-resistant、easier to clean, so you do not have to worry about the quality.\n🧩Professional Design - Neoflavie We have designed an everyday activity for people with dementia and Alzheimer's. The high-saturation & ultra-high-definition & high-contrast large puzzles enhance the hands-on, concentrate and visual appeal of seniors, creating fun, meaningful dementia activities, specifically designed to seniors and people with dementia and Alzheimer's disease games products. The cognitive benefits of repetitive exercises.\n🧩The Puzzle Set Includes - Each large puzzle measures approximately 11.81 x 8.46 x 0.1 inches, 2×16-pieces easy puzzles + 2×35-pieces upgrade puzzles, 4×1:1 Oiginal Image, four divided ziplock bags, and an instructional box to help users assemble the puzzle. These large puzzles provide an enjoyable way to love the family you love.\n🧩The Perfect Gift - Neoflavie puzzles are the perfect gift for seniors and people with dementia or Alzheimer's. The large size puzzle is suitable for people with early to mid-stage dementia and no need to worry, there is no mention of dementia on the package. All day long, your loved one can choose to play with these large pieces of the puzzle and he or she can challenge and enjoy themselves, something very meaningful to them.\n🧩Highly Efficient After-Sales - The package will come with a complete set of puzzles suitable for the elderly, Neoflavie in providing you with fun while also strictly control the quality of the product, if you receive a product you are not satisfied or a part of the puzzle is missing, you can completely contact us to request a replacement or refund, we immediately perform, thank you for supporting small family business.",
		"image": "https://m.media-amazon.com/images/I/81zMeM5H6pL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Beach",
		"title": "Buffalo Games - Aimee Stewart - Tiki Beach Sunset - 1000 Piece Jigsaw Puzzle",
		"previewImg": "https://m.media-amazon.com/images/I/814xhldnA3L._AC_UL320_.jpg",
		"price": "$10.99",
		"numberOfPieces": 1000,
		"age": "14 years and up",
		"description": "Contains a 1000 piece jigsaw puzzle\nFinished size is 26.75 x 19.75 inches\nFull Color Bonus poster included for help in solving\nManufactured from premium quality materials including 100% recycled paperboard\nBuffalo Games puzzles are manufactured using trademarked \"Perfect Snap\" technology ensuring a tight interlocking fit between pieces",
		"image": "https://m.media-amazon.com/images/I/814xhldnA3L.__AC_SY300_SX300_QL70_ML2_.jpg"
	   },
	   {
		"theme": "Beach",
		"title": "Ubeesize 1000 Piece Jigsaw Puzzles for Adults-Seaside Town, Jigsaw Puzzles 1000 Pieces and Up, Puzzle Game for Family Parent-Child, Holiday Puzzles for Educational(20\"x27.5\")",
		"previewImg": "https://m.media-amazon.com/images/I/A1kIWygJxyL._AC_UL320_.jpg",
		"price": "$13.99",
		"numberOfPieces": 1000,
		"age": "6 years and up",
		"description": "[High-Quality Materials] The 1000 pieces of the Seaside Town puzzle are made of high-quality, recycled cardboard and printed with vivid ink. They are sturdy, durable, and resistant to bending. Each puzzle piece undergoes special surface film treatment to ensure bright colors. This puzzle is approximately 2 millimeters thick and features different letter markings on the back of each piece, making each puzzle unique. It also includes a (1:1) poster for additional assistance.\n[Seaside Town Theme] Independent artists created this exquisite 27.5\" x 20\" puzzle based on a beautiful seaside town. The puzzle features bright and vibrant colors that showcase the beauty of houses, mountains, and seas, providing an outstanding visual and aesthetic experience.\n[Fun Challenge Game] This interactive puzzle game brings everyone closer together. Completing puzzles can help develop hand-eye coordination, fine motor skills, problem-solving abilities, shape recognition, memory, and task completion. Puzzles can effectively stimulate people's thinking and train their judgment and patience. Try our 1000-piece puzzle and enjoy leisure time with family or friends.\n[DIY Home Decoration] These beautiful art puzzles make for practical and unique handcrafted decorations or gifts. Once completed with your friends or family, you can use a photo frame to store it and decorate your home with the finished puzzle. They're perfect for decorating offices, bedrooms, restaurants, reading rooms, and more!\n[Best Gift] This large 1000-piece puzzle game is designed for adults or children over the age of 6, making it an exceptional gift for various occasions such as Christmas, Halloween, Children's Day, Easter, birthdays, Valentine's Day, and anniversaries. The exquisite gift box packaging adds an extra touch of elegance to this already amazing gift.",
		"image": "https://m.media-amazon.com/images/I/A1kIWygJxyL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Beach",
		"title": "GoodDay Puzzles 48 Large Piece Jigsaw 'Beach Day' | Dementia/Alzheimer's Activities for Seniors | Easy Puzzle for Adults | Gifts for The Elderly",
		"previewImg": "https://m.media-amazon.com/images/I/81w6eCSs-+L._AC_UL320_.jpg",
		"price": "$22.95",
		"numberOfPieces": 48,
		"description": "OPPORTUNITY FOR CONNECTION ~ A GoodDay Puzzle provides the perfect setting to connect with your loved ones. Work together, and share the satisfying achievement that comes from solving a GoodDay Puzzle.\nENJOY INDEPENDENCE ~ With a full day ahead, your loved one may choose to take on the solo challenge. Good things take time, and working alone can be extremely rewarding.\nMATURE & THOUGHTFUL DESIGN ~ Created with seniors in mind, GoodDay Puzzles are never childish. Furthermore, you can rest assured knowing that this product makes no mention of dementia.\nSTIMULATING IMAGE ~ The beautiful 'Beach Day' painting makes each solve as fun as the last. With vibrant, high-contrast colors, 'Beach Day' can be enjoyed day after day, even by the visually impaired. Some studies suggest that repetition benefits cognition!\nSOLVE ANYWHERE ~ The Build-in-Box design acts as a puzzle tray, allowing the user to assemble the jigsaw directly in the box. This enables the user to solve in a bed, and it makes cleanup a breeze.",
		"image": "https://m.media-amazon.com/images/I/81w6eCSs-+L._AC_SX679_.jpg"
	   },
	   {
		"theme": "Building",
		"title": "Ubeesize 1000 Piece Jigsaw Puzzles for Adults-Seaside Town, Jigsaw Puzzles 1000 Pieces and Up, Puzzle Game for Family Parent-Child, Holiday Puzzles for Educational(20\"x27.5\")",
		"previewImg": "https://m.media-amazon.com/images/I/A1kIWygJxyL._AC_UL320_.jpg",
		"price": "$13.99",
		"numberOfPieces": 1000,
		"age": "6 years and up",
		"description": "[High-Quality Materials] The 1000 pieces of the Seaside Town puzzle are made of high-quality, recycled cardboard and printed with vivid ink. They are sturdy, durable, and resistant to bending. Each puzzle piece undergoes special surface film treatment to ensure bright colors. This puzzle is approximately 2 millimeters thick and features different letter markings on the back of each piece, making each puzzle unique. It also includes a (1:1) poster for additional assistance.\n[Seaside Town Theme] Independent artists created this exquisite 27.5\" x 20\" puzzle based on a beautiful seaside town. The puzzle features bright and vibrant colors that showcase the beauty of houses, mountains, and seas, providing an outstanding visual and aesthetic experience.\n[Fun Challenge Game] This interactive puzzle game brings everyone closer together. Completing puzzles can help develop hand-eye coordination, fine motor skills, problem-solving abilities, shape recognition, memory, and task completion. Puzzles can effectively stimulate people's thinking and train their judgment and patience. Try our 1000-piece puzzle and enjoy leisure time with family or friends.\n[DIY Home Decoration] These beautiful art puzzles make for practical and unique handcrafted decorations or gifts. Once completed with your friends or family, you can use a photo frame to store it and decorate your home with the finished puzzle. They're perfect for decorating offices, bedrooms, restaurants, reading rooms, and more!\n[Best Gift] This large 1000-piece puzzle game is designed for adults or children over the age of 6, making it an exceptional gift for various occasions such as Christmas, Halloween, Children's Day, Easter, birthdays, Valentine's Day, and anniversaries. The exquisite gift box packaging adds an extra touch of elegance to this already amazing gift.",
		"image": "https://m.media-amazon.com/images/I/A1kIWygJxyL.__AC_SY300_SX300_QL70_ML2_.jpg"
	   },
	   {
		"theme": "Building",
		"title": "1000 Piece Jigsaw Puzzle Aegean Sea Jigsaw Puzzle for Adults Teens Greece Santorini Landscape Puzzle Reduced Pressure Toy Gift Natural Scene Puzzles 1000 Pieces Jigsaw Puzzle 1000 Pieces",
		"previewImg": "https://m.media-amazon.com/images/I/81jZoJyC8sL._AC_UL320_.jpg",
		"price": "$18.99",
		"numberOfPieces": 1000,
		"description": "【Package & Size】: 1000 pieces puzzle is packed in a drawstring bag and put in an exquisite gift box together with the full-size bonus poster. The finished size of the jigsaw puzzles 1000 pieces is 26.75 x 19.75 inches\n【Premium Quality】: These jigsaw puzzles with 1000 pieces are made of premium quality recycled white cardboard. With advanced puzzle-making technology, the CHengQiSM puzzles are made of thicker paper, are more durable, and are not easily deformed.\n【Unique Design】: We use precision cutting technology to ensure each piece fits perfectly and has no puzzle dust. Each puzzle piece is printed with no-glare, non-toxic inks. Letters guide on the puzzle back for extra help to make the puzzle game easier.\n【Relax and Decompression】: Art jigsaw puzzles are a fun, precious way to enjoy time at home. Boost your mood, enhance cognitive abilities, and improve short-term memory by building a 1000 piece puzzle\n【1000 Piece Puzzle】: Puzzles are a fun activity to do alone or in a group, and make a great gift for all ages at birthdays and holidays. The challenge of this 1000 puzzle would provide hours of amusement for you, your friends, or for your whole family. It is engaging, fun, and exercises the mind",
		"image": "https://m.media-amazon.com/images/I/81jZoJyC8sL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Building",
		"title": "Melissa & Doug Dinosaurs Wooden Jigsaw Puzzle With Storage Tray (24 pcs)",
		"previewImg": "https://m.media-amazon.com/images/I/81LnDDKmHxL._AC_UL320_.jpg",
		"price": "$7.99",
		"numberOfPieces": 24,
		"description": "24-piece wooden jigsaw puzzle\nExciting dinosaur illustration\nPackaged in a sturdy wooden tray for puzzle building and storage\nSturdy wooden construction\nPromotes hand-eye coordination, fine motor skills, and problem-solving skills.",
		"image": "https://m.media-amazon.com/images/I/81LnDDKmHxL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Building",
		"title": "White Mountain Puzzles Mini Cereal Boxes - 100 Piece Puzzles - Six Pack of Puzzles",
		"previewImg": "https://m.media-amazon.com/images/I/81JXMRaWjdL._AC_UL320_.jpg",
		"price": "$16.99",
		"numberOfPieces": 100,
		"description": "Six individual puzzles: all your childhood name brands are here in six individual cereal puzzles, each with 100 puzzle pieces. There's Lucky Charms, Cheerios, Honey Nut Cheerios, Cinnamon Toast Crunch, Cocoa Puffs and Trix\nCereal memories: lovely puzzle artwork can evoke joyous memories of home, or spark conversations of past good times! Sure to delight. Treat yourself to some cereal fun!\nAmazing benefits of puzzle building: puzzles enhance motor skills, hand-eye coordination & problem-solving skills. Delays cognitive decline, improves short term memory, mood & spatial awareness.\nPuzzle artistry: combines the artwork with the design of the cut pieces to enhance the enjoyment of the user. Complexity of cut, artistry & detail are all evident of the quality of each piece.\nQuality pieces: 100 large, easy to handle interlocking pieces in 6 unique puzzles. Made of sturdy blue chipboard on recycled paper. Completed Dimensions: 9x7 inches. Made in USA.",
		"image": "https://m.media-amazon.com/images/I/81JXMRaWjdL.__AC_SY300_SX300_QL70_ML2_.jpg"
	   },
	   {
		"theme": "Building",
		"title": "Bgraamiens Puzzle-City Street-1000 Pieces Creative Colorful City Street View Jigsaw Puzzle Color Challenge Puzzle",
		"previewImg": "https://m.media-amazon.com/images/I/81cLN1q8JpL._AC_UL320_.jpg",
		"price": "$18.99",
		"numberOfPieces": 1000,
		"age": "12 years and up",
		"description": "★ADVANCED CHALLENGE: The Bgraamiens Puzzles–City Street is a 1,000 pieces puzzle worthy of any skilled puzzler. This puzzle is a scenery of the city street which is created with beautiful shapes. Vivid color and different buildings make the puzzle very enjoyable. All the unique features created such a beautiful and challenge work. This is definitely a great test for the puzzler fanatic to enjoy!\n★1000 PIECES OF FUN: Challenge your family and friends and provide hours of fun and entertainment piecing this remarkable puzzle together, sure to become a permanent addition to your home.\n★SPECIFICS: Includes 1000 large puzzle pieces made of sturdy chipboard on recycled paper. Completed puzzle dimensions: 29.5*19.7 inches.\n★MORE TO PUZZLE BUILDING: Art jigsaw puzzles are a fun, inexpensive way to enjoy beautiful works of art first hand! Use to boost skills: hand-eye coordination, motor skills, problem solving, etc.\n★Easy Operation - Back sides of pieces are divided into several areas with letters marked as English letters \"A\" \"B\"…which helps to make work easier",
		"image": "https://m.media-amazon.com/images/I/81cLN1q8JpL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Car",
		"title": "4 Pack Large Pieces Jigsaw Puzzles Dementia Alzheimer's Products,Neoflavie 4 Style Puzzle Activities for Elderly Seniors - Easy Puzzle for Adults, Ultra-High-Definition（2 ×16 & 2 ×35 Large Puzzles）",
		"previewImg": "https://m.media-amazon.com/images/I/81zMeM5H6pL._AC_UL320_.jpg",
		"price": "$17.99",
		"numberOfPieces": 4,
		"age": "12 years and up",
		"description": "🧩Puzzles of Blue Card Materials - Neoflavie's each piece of large puzzles use hard cardstock, each piece of large puzzles are thicker to 0.1 inches, can be used repeatedly. 1:1 Oiginal Image-it can help you when you are overwhelmed what to do next. the surface is printed with Matte film to improve the friction easier to grasp、water-resistant、easier to clean, so you do not have to worry about the quality.\n🧩Professional Design - Neoflavie We have designed an everyday activity for people with dementia and Alzheimer's. The high-saturation & ultra-high-definition & high-contrast large puzzles enhance the hands-on, concentrate and visual appeal of seniors, creating fun, meaningful dementia activities, specifically designed to seniors and people with dementia and Alzheimer's disease games products. The cognitive benefits of repetitive exercises.\n🧩The Puzzle Set Includes - Each large puzzle measures approximately 11.81 x 8.46 x 0.1 inches, 2×16-pieces easy puzzles + 2×35-pieces upgrade puzzles, 4×1:1 Oiginal Image, four divided ziplock bags, and an instructional box to help users assemble the puzzle. These large puzzles provide an enjoyable way to love the family you love.\n🧩The Perfect Gift - Neoflavie puzzles are the perfect gift for seniors and people with dementia or Alzheimer's. The large size puzzle is suitable for people with early to mid-stage dementia and no need to worry, there is no mention of dementia on the package. All day long, your loved one can choose to play with these large pieces of the puzzle and he or she can challenge and enjoy themselves, something very meaningful to them.\n🧩Highly Efficient After-Sales - The package will come with a complete set of puzzles suitable for the elderly, Neoflavie in providing you with fun while also strictly control the quality of the product, if you receive a product you are not satisfied or a part of the puzzle is missing, you can completely contact us to request a replacement or refund, we immediately perform, thank you for supporting small family business.",
		"image": "https://m.media-amazon.com/images/I/81zMeM5H6pL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Car",
		"title": "Jumbo, Jan Van Haasteren - Grand Prix, Jigsaw Puzzles for Adults, 1,000 Piece",
		"previewImg": "https://m.media-amazon.com/images/I/61-BoIOpuXL._AC_UL320_.jpg",
		"price": "$19.99",
		"numberOfPieces": 1000,
		"description": "A 1000 piece jigsaw puzzle\nHilarious illustration of ‘The Start’\nThe puzzle image has been produced by the talented and popular artist, Jan van Haasteren\nThe jigsaw puzzle has been produced using high quality cardboard\nThe completed puzzle measures 68 x 49cm (approximately)",
		"image": "https://m.media-amazon.com/images/I/61-BoIOpuXL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Car",
		"title": "Keeping Busy Dementia Puzzles for Elderly - Large Piece Puzzles for Seniors - 35 Piece Jigsaw Puzzle Hot Rod Show - Color Coded with Templates - Dementia Activities for Seniors - Easy Adult Puzzle",
		"previewImg": "https://m.media-amazon.com/images/I/91WBmsNZaSL._AC_UL320_.jpg",
		"price": "$22.99",
		"numberOfPieces": 35,
		"description": "RELAXRELAXING ACTIVITY FOR SENIORS: Our Hot Rod Show picture puzzle was designed to be age-appropriate for elderly people living with memory-related conditions. Every game includes 35 large pieces that are color coded with 3 templates.ING ACTIVITY FOR SENIORS: Our Hot Rod Show picture puzzle was designed to be age-appropriate for elderly people living with memory-related conditions. Every game includes 35 large pieces to encourage engagement and gently exercise the mind.\nSUITABLE FOR ALL ABILITIES: This jigsaw puzzle is suitable for older people of all cognitive abilities. Unlike most puzzles, ours features color sequencing with an outline sheet that acts as a board to help participants successfully complete the jigsaw. Included are three puzzle guides to assist with puzzle piece placement and a full color photograph of the puzzle picture. The jigsaw design ensures that each piece is uniquely shaped to avoid confusion.\nSIMPLE PUZZLE GAME: Ideal for those who are struggling with memory loss or alzheimers, our puzzle for adults promotes concentration and mental clarity while still offering relaxation and entertainment in an easy-to-understand format. Colored bags included offering an enjoyable sorting game with a sense of accomplishment.\nOFFERS MENTAL STIMULATION: This jigsaw puzzle for seniors features 35 large pieces with a colored dot on the back to correspond with the board. The brightly colored image encourages discussion and reminiscing which can help improve engagement and preserve memories. Also included is a discussion guide related to the puzzle's picture.\nDESIGNED FOR THOSE WITH DEMENTIA: At Keeping Busy, we create toys and puzzles to help those with dementia and Alzheimer's live a more fulfilling life. Our games for people with dementia have been designed for older people, and aim to nurture their mental health and wellbeing.",
		"image": "https://m.media-amazon.com/images/I/91WBmsNZaSL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Car",
		"title": "Springbok's 1000 Piece Jigsaw Puzzle Mel's Drive in - Made in USA - Unique Cut Pieces",
		"previewImg": "https://m.media-amazon.com/images/I/71z-bIvM7TL._AC_UL320_.jpg",
		"price": "$19.95",
		"numberOfPieces": 1000,
		"age": "3 years and up",
		"description": "1000 PIECE PUZZLE FOR ADULTS - Featuring a finished size of 30 inches by 24 inches with a precision cut that ensures a tight, interocking heirloom-quality puzzle\nUNIQUE CUT LARGE PIECES - Each puzzle piece is unique and never repeated; Springbok Puzzle pieces are made from thick cut 75 point board, 18% thicker than the industry average\nECO-FRIENDLY & HIGH QUALITY - Springbok Puzzles are manufactured with sustainably sourced organic, non-toxic soy-based inks & utilizes 100% recycled puzzle board materials\nMADE IN USA - Manufactured in Kansas City, Missouri; Springbok Puzzles have been American made since 1963\nMISSING PIECE NO WORRY WARRANTY - All Springbok Puzzles are covered with our satisfaction guarantee on materials and craftmanship",
		"image": "https://m.media-amazon.com/images/I/71z-bIvM7TL.__AC_SY300_SX300_QL70_ML2_.jpg"
	   },
	   {
		"theme": "Car",
		"title": "MasterPieces 750 Piece Jigsaw Puzzle for Adults, Family, Or Kids - Triple Threat - 18\"x24\"",
		"previewImg": "https://m.media-amazon.com/images/I/81R5q7eMVWL._AC_UL320_.jpg",
		"price": "$16.99",
		"numberOfPieces": 750,
		"description": "Shiny Muscle cars and Classic Gas Stations\n750 Puzzle Pieces Finished 18 inch x 24 inch puzzle\nThick recycled puzzle board and random cut pieces ensure a tight interlocking fit and create a fun experience",
		"image": "https://m.media-amazon.com/images/I/81R5q7eMVWL.__AC_SX300_SY300_QL70_ML2_.jpg"
	   },
	  {
		"theme": "Cartoon",
		"title": "Ceaco - Disney - Disney Princess - Oversized 300 Piece Jigsaw Puzzle",
		"previewImg": "https://m.media-amazon.com/images/I/91B0tK2I6aL._AC_UL320_.jpg",
		"price": "$14.99",
		"numberOfPieces": 300,
		"age": "12 years and up",
		"description": "Includes 300 Oversized Puzzle Pieces\n18 Inches x 24 Inches When Completed\nDisney Princess is Just One of Dozens of Beautiful Disney Collection 300 Oversized Piece Puzzles Available\nProudly Brought to You by Ceaco!\nGreat for Family Nights, Gifts, Holiday Gatherings, Preschool, Kids, First Puzzlers, Disney Collectors and more.",
		"image": "https://m.media-amazon.com/images/I/91B0tK2I6aL.__AC_SY300_SX300_QL70_ML2_.jpg"
	   },
	   {
		"theme": "Cartoon",
		"title": "Ravensburger Disney Treasures from The Vault: Baloo 1000 Piece Jigsaw Puzzle for Adults – Every Piece is Unique, Softclick Technology Means Pieces Fit Together Perfectly - Amazon Exclusive",
		"previewImg": "https://m.media-amazon.com/images/I/81nY2Z-O7jL._AC_UL320_.jpg",
		"price": "$9.73",
		"numberOfPieces": 1000,
		"age": "10 years and up",
		"description": "Bestselling puzzle brand worldwide - With over 1 billion puzzles sold, Ravensburger is the bestselling puzzle brand worldwide.\nWhat you get – 1000 piece Disney Treasures from the Vault jigsaw puzzles by Ravensburger are crafted with premium quality, in terms of both content and material, and have a completed size of 27\" x 20\".\nAnti-Glare surface - Ravensburger puzzles use an exclusively developed, extra-thick cardboard combined with our fine, linen structured paper to create a glare-free puzzle image and give you the best experience possible.\nEvery piece is unique – None of the frustrations you find with other puzzle brands. With Ravensburger, every individual piece has a completely unique shape.\nMakes a great gift - Puzzles are a fun activity to do on a cold fall or winter day, and make a great gift for all ages at Christmas and over the entire holiday season",
		"image": "https://m.media-amazon.com/images/I/81nY2Z-O7jL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Cartoon",
		"title": "EonBlue Unicorn Princess 150 Piece Jigsaw Puzzle for Kids Ages 4-8, Fun Learning Educational Gifts for 5 6 Year Old Girl Boy Toy Animals Puzzles Game, Every Pieces Unique Fit Together Perfectly",
		"previewImg": "https://m.media-amazon.com/images/I/819J6B39UmL._AC_UL320_.jpg",
		"price": "$9.99",
		"numberOfPieces": 150,
		"age": "36 months - 12 years",
		"description": "Paper\nImported\n🦄【This 150pc Puzzle】This puzzle for kids features a beautiful princess and unicorn illustration. It is perfectly sized for elementary and preschool learning\n🦄【Designed for Kids Ages 4-8】 kids puzzles have durable pieces little hands can easily hold for lots of repeat amusement.\n🦄【Puzzling Experience】Entertaining images to stimulate children's interest and curiosity. Clean-cut pieces perfect interlocking fit.\n🦄【Sturdy&Colorful & Glare Free】Durable high-quality paper material, Vivid colors with a matte finish for an easy-to-clean surface.\n🦄【Positive Benefits】Jigsaw puzzles help support children's development as they play by promoting problem-solving, dexterity, concentration, and collaboration skills. They make a great birthday gift or holiday gift! When you teach a child to love puzzling at a young age, you're encouraging their growth and development!",
		"image": "https://m.media-amazon.com/images/I/819J6B39UmL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Cartoon",
		"title": "1000 Piece Jigsaw Puzzle for Adults - Cartoon Puzzle Challenging Educational Fun Family Games - Toy Puzzles for Teens and Kids",
		"previewImg": "https://m.media-amazon.com/images/I/71ovdR4SkjL._AC_UL320_.jpg",
		"price": "$14.99",
		"numberOfPieces": 1000,
		"description": "❤Wooden Jigsaw Puzzles: These 1000 piece puzzles are made from superior quality, highly durable wood, after fine polished, have a smooth surface and round corner, safe for little ones.\n❤Entertainment: Puzzle can calm your mind and enjoy the fun of jigsaw puzzle. You can also play jigsaw puzzles with your family to make the relationship between your family closer.\n❤Perfect Puzzle Game: THAWR jigsaw puzzle can help to supercharge your brain. The ideal intellectual game for adults and kids. Good choice for Birthday and Christmas gifts.\n❤Home Decor: You can choose to hang them on the wall which will be the coolest decor for your home after you completing the puzzle.\n❤Customer Service: If anything goes wrong with wooden jigsaw puzzles, or you decide it is just not for you, we will always be there and help you to make all things right.",
		"image": "https://m.media-amazon.com/images/I/71ovdR4SkjL._AC_SX679_.jpg"
	   },
	   {
		"theme": "Cartoon",
		"title": "Ceaco - Peanuts - Peace and Presents - Holiday - 100 Piece Jigsaw Puzzle",
		"previewImg": "https://m.media-amazon.com/images/I/81yhOmW6uML._AC_UL320_.jpg",
		"price": "$9.99",
		"numberOfPieces": 100,
		"age": "5 years and up",
		"description": "Ceaco 2021 Holiday Jigsaw Puzzle Collections!!\nContains 100 Piece Jigsaw Puzzle\nOversized Pieces\n15 Inches x 11 Inches when Completed\nProudly Made of 100% Recycled Materials in the USA by Ceaco!",
		"image": "https://m.media-amazon.com/images/I/81yhOmW6uML.__AC_SY300_SX300_QL70_ML2_.jpg"
	   }
	]
   